# Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

# using pandas series

In [3]:
list_1=['a','b','c','d']
labels=[1,2,3,4]

In [7]:
ser_1=pd.Series(data=list_1,index=labels)

In [8]:
ser_1

1    a
2    b
3    c
4    d
dtype: object

# Using numpy array

In [11]:
arr_1=np.array([1,2,3,4])
arr_2=pd.Series(arr_1)
arr_2

0    1
1    2
2    3
3    4
dtype: int64

# Using dictionary

In [16]:
dict_1={'name:':'sanowar','last_name:':'hossain','age:':34}
dict_2=pd.Series(dict_1)
dict_2

name:         sanowar
last_name:    hossain
age:               34
dtype: object

In [22]:
dict_2['name:']#get the value or label

'sanowar'

In [26]:
dict_2.dtype#get the datatype

dtype('O')

# Using math operation of Series

In [27]:
arr_2+arr_2

0    2
1    4
2    6
3    8
dtype: int64

In [28]:
arr_2-arr_2

0    0
1    0
2    0
3    0
dtype: int64

In [29]:
arr_2*arr_2

0     1
1     4
2     9
3    16
dtype: int64

In [30]:
arr_2/arr_2

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float64

# Using NumPy Methods

In [32]:
np.exp(arr_2)

0     2.718282
1     7.389056
2    20.085537
3    54.598150
dtype: float64

# Using DataFrames

DataFrames are the most commonly used `data structure with Pandas`. They are made up of multiple series that share the same index / label. They can contain multiple data types. They can be created from `dicts, series, lists or other dataframes`.

In [33]:
from numpy import random

In [40]:
#create random matrix 2x3 with values between 10 to 50

mat=np.random.randint(10,50,size=(3,2))
mat

array([[14, 10],
       [11, 30],
       [23, 30]])

In [43]:
#create a DataFrame with row lables and columns labels

df=pd.DataFrame(mat,['a','b','c'],['d','e'])
df

    d   e
a  14  10
b  11  30
c  23  30

# Create DataFrame using multiple series in a dictionary

In [44]:
dict_3={'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([4,5,6],index=['d','e','f'])}

In [47]:
df_1=pd.DataFrame(dict_3)
df_1

   one  two
a  1.0  NaN
b  2.0  NaN
c  3.0  NaN
d  NaN  4.0
e  NaN  5.0
f  NaN  6.0

# from dict accepts a column labels and lists

In [49]:
pd.DataFrame.from_dict(dict([('A',[1,2,3]),('B',[4,5,6])]))

   A  B
0  1  4
1  2  5
2  3  6

In [50]:
# You can assign the keys as row labels and column labels separate
# with orient='index'
pd.DataFrame.from_dict(dict([("A",[1,2,3]),('B',[4,5,6])]),orient='index',columns=['one','two','three'])

   one  two  three
A    1    2      3
B    4    5      6

In [51]:
#get number of rows and columns as tuple
print(df_1.shape)

(6, 2)

# Editing and Retrieving Data

### show single column

In [53]:
df['d']

a    14
b    11
c    23
Name: d, dtype: int64

### show multiple column

In [55]:
df[['d','e']]

    d   e
a  14  10
b  11  30
c  23  30

### Grab row as a Series

In [59]:
df.loc['c']

d    23
e    30
Name: c, dtype: int64

### Grab cell with row and column

In [62]:
df.loc['a','d']#first row then column

14

In [63]:
df.loc['c','d']

23

#### Grab multiple cell

In [74]:
print(df.loc[['a','b'],['d','e']])

    d   e
a  14  10

## Grab Row by index position

colon : means range

In [77]:
df.iloc[0]#1st row

d    14
e    10
Name: a, dtype: int64

In [78]:
df.iloc[1]#2nd row

d    11
e    30
Name: b, dtype: int64

In [79]:
df.iloc[:]#all rows and columns

    d   e
a  14  10
b  11  30
c  23  30

In [80]:
df.iloc[1:]#2nd row and all columns

    d   e
b  11  30
c  23  30

In [81]:
df.iloc[:,-1]#all rows and last column

a    10
b    30
c    30
Name: e, dtype: int64

In [82]:
df.iloc[:, :-1]#all rows and all columns except last column

    d
a  14
b  11
c  23

In [84]:
df.iloc[:2,:-1]

    d
a  14
b  11

# Mathmatical Operation

In [93]:
df['total']=df['d']+df['e']#row wise total
df['total']

a    24.0
b    41.0
c    53.0
f     NaN
f     NaN
f     NaN
Name: total, dtype: float64

In [94]:
df_mul=df['d']*df['e']
df_mul

a    140.0
b    330.0
c    690.0
f      NaN
f      NaN
f      NaN
dtype: float64

# Make a new row by appending

In [95]:
dict_2={'C':44,'D':45,"E":46}
new_row=pd.Series(dict_2,name='f')
df=df.append(new_row)
df

      d     e     C     D     E  total
a  14.0  10.0   NaN   NaN   NaN   24.0
b  11.0  30.0   NaN   NaN   NaN   41.0
c  23.0  30.0   NaN   NaN   NaN   53.0
f   NaN   NaN  44.0  45.0  46.0    NaN
f   NaN   NaN  44.0  45.0  46.0    NaN
f   NaN   NaN  44.0  45.0  46.0    NaN
f   NaN   NaN  44.0  45.0  46.0    NaN

# removing the column

In [96]:
df.drop('total',axis=1, inplace=True)

In [97]:
df

      d     e     C     D     E
a  14.0  10.0   NaN   NaN   NaN
b  11.0  30.0   NaN   NaN   NaN
c  23.0  30.0   NaN   NaN   NaN
f   NaN   NaN  44.0  45.0  46.0
f   NaN   NaN  44.0  45.0  46.0
f   NaN   NaN  44.0  45.0  46.0
f   NaN   NaN  44.0  45.0  46.0

# Removing row

In [98]:
df.drop('f',axis=0,inplace=True)

In [99]:
df

      d     e   C   D   E
a  14.0  10.0 NaN NaN NaN
b  11.0  30.0 NaN NaN NaN
c  23.0  30.0 NaN NaN NaN

# Create new column and make it index

In [101]:
df['sex']=['men','women','both']

In [102]:
df.set_index('sex',inplace=True)

In [103]:
df

          d     e   C   D   E
sex
men    14.0  10.0 NaN NaN NaN
women  11.0  30.0 NaN NaN NaN
both   23.0  30.0 NaN NaN NaN

# Create reset index values to number

In [104]:
df.reset_index(inplace=True)

In [105]:
df

     sex     d     e   C   D   E
0    men  14.0  10.0 NaN NaN NaN
1  women  11.0  30.0 NaN NaN NaN
2   both  23.0  30.0 NaN NaN NaN

# Assign

Assign can be used to create a column while leaving the original DF untouched

In [107]:
df.assign(div=df['d'] / df['e'])

     sex     d     e   C   D   E       div
0    men  14.0  10.0 NaN NaN NaN  1.400000
1  women  11.0  30.0 NaN NaN NaN  0.366667
2   both  23.0  30.0 NaN NaN NaN  0.766667

In [108]:
df.assign(div=lambda x: (x['d']/x['e']))

     sex     d     e   C   D   E       div
0    men  14.0  10.0 NaN NaN NaN  1.400000
1  women  11.0  30.0 NaN NaN NaN  0.366667
2   both  23.0  30.0 NaN NaN NaN  0.766667

# Create a DataFrame with a nan values

In [139]:
df = pd.DataFrame({'A': [1., np.nan, 3., np.nan]})
df = pd.DataFrame({'A': [8., 9., 2., 4.]})
df.combine_first(df)

     A
0  8.0
1  9.0
2  2.0
3  4.0

# Conditional Selection

In [142]:
arr_3=np.random.randint(10,50,size=(2,3))
df=pd.DataFrame(arr_3,['A','B'],['C','D','E'])
df

    C   D   E
A  41  45  12
B  12  48  17

In [143]:
#Greater than 40
df>40

       C     D      E
A   True  True  False
B  False  True  False

In [148]:
print(df[df>40])

      C   D   E
A  41.0  45 NaN
B   NaN  48 NaN

In [153]:
print(df[df.gt(40)])

      C   D   E
A  41.0  45 NaN
B   NaN  48 NaN

# we can use comparison operater functions as well like: 
# gt, lt, ge, le, eq, ne

In [155]:
print(df[df.lt(40)])

      C   D   E
A   NaN NaN  12
B  12.0 NaN  17

# Using Bools

In [156]:
bool_1=df>45

In [157]:
df[bool_1]

    C     D   E
A NaN   NaN NaN
B NaN  48.0 NaN

In [158]:
df['E']>45#for column

A    False
B    False
Name: E, dtype: bool

In [162]:
df[df['D']>45]#return a column if bool is matched with condition

    C   D   E
B  12  48  17

In [166]:
df_1=df[df['E']>10]#focus on a column based on resulting dataframe
df_1['C']

A    41
B    12
Name: C, dtype: int64

In [168]:
print(df[df['E']>12]['C'])

B    12
Name: C, dtype: int64

In [170]:
# You can also grab multiple columns
print(df_1[df_1['E']>10][['C', 'D']])
print()

    C   D
A  41  45
B  12  48

In [171]:
# You can use multiple conditions
arr_3 = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df_2 = pd.DataFrame(arr_3, ['A', 'B', 'C'], ['X', 'Y', 'Z'])
print(df_2, "\n")
# You can use or '|' and '&' condition to combine conditions as well
df_2[(df_2['X']>3) & (df_2['X']<7)]

   X  Y  Z
A  1  2  3
B  4  5  6
C  7  8  9

   X  Y  Z
B  4  5  6

# File Input and Output

Pandas can work with the following types of data : CSV, Plain Text, JSON, XML, PDF, SQL, HTML, XLSX, DOCX, ZIP, Images Hierarchical Data Format, MP3, and MP4.

In [173]:
# !pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 1.8 MB/s eta 0:00:011
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [174]:
import pymysql

## Read CSV

In [175]:
cs_df=pd.read_csv('ComputerSales.csv')

In [176]:
cs_df.to_csv('ComputerSalesBU.csv',index=False) ## Save a CSV file, but don't save the index as a column

# Read Excel and save excel

In [177]:
# You can read data from Excel, but not formulas and macros
pd.read_excel('Financial Sample.xlsx',0)

# Write to Excel
cs_df.to_excel('ComputerSales.xlsx')

In [180]:
# Check if written
pd.read_excel('ComputerSales.xlsx',0)

,Unnamed: 0,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
1,1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018
2,2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018
3,3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018
4,4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018
5,5,6,Sally Struthers,F,45,PA,GT13-0024,Desktop,1249.99,230.89,Flyer 2,April,2018
6,6,7,Michelle Samms,F,46,OH,GA401IV,Laptop,1349.99,180.34,Email,May,2018
7,7,8,Mick Roberts,M,23,OH,MY2J2LL,Tablet,999.99,146.69,Website,July,2018
8,8,9,Ed Klondike,M,52,OH,81TC00,Laptop,649.99,122.34,Email,July,2018
9,9,10,Phil Jones,M,56,WV,M01-F0024,Desktop,479.99,143.39,Flyer 2,August,2018
10,10,11,Rick James,M,49,PA,GA401IV,Laptop,1349.99,180.34,Flyer 3,November,2018
11,11,12,Sue Etna,F,54,OH,GT13-0024,Desktop,1249.99,230.89,Flyer 2,November,2018
12,12,13,Jason Case,M,57,PA,81TC00,Laptop,649.99,122.34,Email,November,2018
13,13,14,Doug Johnson,M,51,PA,I3670,Desktop,649.99,118.64,Website,December,2018
14,14,15,Andy Sands,M,56,OH,MY2J2LL,Tablet,999.99,146.69,Flyer 1,December,2018
15,15,16,Kim Collins,F,49,PA,I3593,Laptop,399.99,72.09,Flyer 2,January,2019
16,16,17,Edna Sanders,F,46,OH,15M-ED,Laptop,699.99,98.09,Email,February,2019
17,17,18,Michelle Samms,F,46,NY,MY2J2LL,Tablet,999.99,146.69,Website,March,2019
18,18,19,Mick Roberts,M,23,PA,I3593,Laptop,399.99,72.09,Flyer 4,March,2019
19,19,20,Sally Struthers,F,45,NY,81TC00,Laptop,649.99,122.34,Website,April,2019
20,20,21,Jason Case,M,57,PA,M01-F0024,Desktop,479.99,143.39,Flyer 4,May,2019
21,21,22,Doug Johnson,M,51,PA,GA401IV,Laptop,1349.99,180.34,Website,August,2019
22,22,23,Paul Thomas,M,43,OH,81TC00,Laptop,649.99,122.34,Website,August,2019
23,23,24,Margo Simms,F,37,WV,Q526FA,Laptop,1049.99,143.09,Flyer 4,November,2019
24,24,25,Michelle Samms,F,46,NY,I3670,Desktop,649.99,118.64,Flyer 2,November,2019
25,25,26,Mick Roberts,M,23,PA,Q526FA,Laptop,1049.99,143.09,Email,November,2019
26,26,27,Ed Klondike,M,52,OH,Q526FA,Laptop,1049.99,143.09,Website,December,2019
27,27,28,Moe Eggert,M,35,PA,15M-ED,Laptop,699.99,98.09,Email,December,2019
28,28,29,Jessica Elk,F,55,PA,GA401IV,Laptop,1349.99,180.34,Flyer 2,December,2019
29,29,30,Phil Jones,M,56,WV,M01-F0024,Desktop,479.99,143.39,Flyer 2,January,2020
30,30,31,Rick James,M,49,PA,GA401IV,Laptop,1349.99,180.34,Flyer 1,January,2020
31,31,32,Sue Etna,F,54,OH,GT13-0024,Desktop,1249.99,230.89,Flyer 2,February,2020
32,32,33,Kim Collins,F,49,PA,I3593,Laptop,399.99,72.09,Flyer 2,March,2020
33,33,34,Edna Sanders,F,46,OH,15M-ED,Laptop,699.99,98.09,Email,March,2020
34,34,35,Michelle Samms,F,46,NY,MY2J2LL,Tablet,999.99,146.69,Website,April,2020
35,35,36,Sally Struthers,F,45,NY,81TC00,Laptop,649.99,122.34,Website,April,2020
36,36,37,Jason Case,M,57,PA,M01-F0024,Desktop,479.99,143.39,Flyer 4,April,2020
37,37,38,Doug Johnson,M,51,PA,GA401IV,Laptop,1349.99,180.34,Website,May,2020
38,38,39,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,May,2020

# MySQL Database connection

In [ ]:
# Read from MySQL Database
try:
    db_connection = pymysql.connect(db='students', user='studentadmin', passwd='TurtleDove', host='localhost', port=3306)

    stud_df = pd.read_sql('SELECT * FROM students', con=db_connection)
    # print(stud_df)
except Exception as e:
    print("Exception : {}".format(e))
finally:
    db_connection.close()

In [ ]:
# Write to table 
try:
    db_connection = pymysql.connect(db='students', user='studentadmin', passwd='TurtleDove', host='localhost', port=3306)
    # Used to issue queries
    cursor = db_connection.cursor()
    # Query to enter new student
    insert_stmt = "INSERT INTO students VALUES(NULL, 'Frank', 'Silva', 'fsilva@aol.com', '666 Hell St', 'Yakima', 'WA', 98901, '792-223-8966', '1959-2-22', 'M', NOW(), 3.50)"
    # Execute query
    cursor.execute(insert_stmt)
    # Commit changes to DB
    db_connection.commit()
    stud_df = pd.read_sql('SELECT * FROM students', con=db_connection)
    print(stud_df)
except Exception as e:
    print("Exception : {}".format(e))
finally:
    db_connection.close()

# Just get 1 column of data

In [181]:
 
cs_df_st = pd.read_csv('ComputerSales.csv', usecols=["State"], squeeze=True)
cs_df_st

0     OH
1     WV
2     PA
3     PA
4     PA
5     PA
6     OH
7     OH
8     OH
9     WV
10    PA
11    OH
12    PA
13    PA
14    OH
15    PA
16    OH
17    NY
18    PA
19    NY
20    PA
21    PA
22    OH
23    WV
24    NY
25    PA
26    OH
27    PA
28    PA
29    WV
30    PA
31    OH
32    PA
33    OH
34    NY
35    NY
36    PA
37    PA
38    PA
Name: State, dtype: object

# Basics & Math

In [182]:
# Display 1st 5 rows
cs_df.head()
# Display last 5 rows
cs_df.tail()
# Get 1st 2
cs_df[:2]
# Get 1st through 5 with a 2 step
cs_df[:5:2]

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018

# Get indexes

In [183]:
# Get indexes
cs_df.index.array
# Get NumPy array
cs_df.to_numpy()
# Get array from series
ser_1.array

<PandasArray>
['a', 'b', 'c', 'd']
Length: 4, dtype: object

In [184]:

dict_3 = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
         'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df_2 = pd.DataFrame(dict_3)

In [185]:
# You can replace NaN values with 0 or anything else
print(df_2.fillna(0))
# Get values in row 2
row = df_2.iloc[1]
# Add items in row 2 to all rows including row 2
# You can do the same with sub, mul, and div
df_2.add(row, axis='columns')

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  0.0  4.0

   one  two
a  3.0  3.0
b  4.0  4.0
c  5.0  5.0
d  NaN  6.0

In [186]:
# Get column 2
col = df_2['two']
# Subtract from other columns
df_2.sub(col, axis=0)

# Check if empty
df_2.empty

False

In [187]:
# Transform executes a function on a dataframe
df_5 = pd.DataFrame({'A': range(3), 'B': range(1, 4)})

In [188]:
df_5.transform(lambda x: x+1)

   A  B
0  1  2
1  2  3
2  3  4

In [189]:
df_5.transform(lambda x: x+1)
df_5.transform(lambda x: x**2)
df_5.transform(lambda x: np.sqrt(x))
# You can transform using multiple functions
df_5.transform([lambda x: x**2, lambda x: x**3])
# Passing a dictionary allows you to perform different calculations
# on different columns
df_5.transform({'A': lambda x: x**2, 'B': lambda x: x**3})

   A   B
0  0   1
1  1   8
2  4  27

In [190]:
# map performs a function on a series
df_5['A'].map(lambda x: x**2)

# applymap does the same on a dataframe
df_5.applymap(lambda x: x**2)

# Get unique values in column 2 of DF
df_2['two'].unique()

# Get number of uniques
df_2['two'].nunique()

# Get the number of times each value showed in column 2
df_2['two'].value_counts()

# Get column names
df_2.columns

# Get index info
df_2.index

# Return a DF that lists null values as True
df_2.isnull()

     one    two
a  False  False
b  False  False
c  False  False
d   True  False

# Group Data

In [193]:
# Groupby allows you to group rows based on a columnand perform a function
# that combines those values (Aggregate Function)
dict_5 = {'Store': [1,2,1,2], 'Flavor': ['Choc', 'Van', 'Straw', 'Choc'], 
         'Sales': [26, 12, 18, 22]}

df_11 = pd.DataFrame(dict_5)

# Group data by the store number
by_store = df_11.groupby('Store')
# Get mean sales by store
by_store.mean()

       Sales
Store
1       22.0
2       17.0

In [194]:
# Get sales total just for store 1
by_store.sum().loc[1]

Sales    44
Name: 1, dtype: int64

In [195]:
# You can use multiple functions of get a bunch
by_store.describe()

      Sales
      count  mean       std   min   25%   50%   75%   max
Store
1       2.0  22.0  5.656854  18.0  20.0  22.0  24.0  26.0
2       2.0  17.0  7.071068  12.0  14.5  17.0  19.5  22.0

# Concat, Merge and Join Data

In [196]:
# You can concatenate DFs in the order DFs are provided
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6]},
                    index=[1,2,3])
df_13 = pd.DataFrame({'A': [7,8,9],
                     'B': [10,11,12]},
                    index=[4,5,6])

In [197]:
pd.concat([df_12, df_13])

   A   B
1  1   4
2  2   5
3  3   6
4  7  10
5  8  11
6  9  12

# Merge

In [198]:
# Merge 2 DFs using their shared key column
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6],
                     'key': [1,2,3]})
df_13 = pd.DataFrame({'A': [7,8,9],
                     'B': [10,11,12],
                     'key': [1,2,3]})
# inner merges at the intersection of keys
pd.merge(df_12, df_13, how='inner', on='key')
# how='left' or 'right' : Use keys from left or right frame
# how='outer' : Use union of keys

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

# Join

In [199]:
# You can join DFs with different indexes and instead of using 
# keys use a column
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6]},
                    index=[1,2,3])
df_13 = pd.DataFrame({'C': [7,8,9],
                     'D': [10,11,12]},
                    index=[1,4,5])
df_12.join(df_13, how='outer')

     A    B    C     D
1  1.0  4.0  7.0  10.0
2  2.0  5.0  NaN   NaN
3  3.0  6.0  NaN   NaN
4  NaN  NaN  8.0  11.0
5  NaN  NaN  9.0  12.0

# Statistics

In [ ]:
# Get ice cream sales data
ics_df = pd.read_csv('icecreamsales.csv')
ics_df

# Get total count of both columns
ics_df.count()

# skipna skips null / NaN values
ics_df.sum(skipna=True)
# Get mean for named column
ics_df["Sales"].mean()
ics_df["Sales"].median()
ics_df["Sales"].mode()
ics_df["Sales"].min()
ics_df["Sales"].max()
ics_df["Sales"].prod() # Product of values
ics_df["Sales"].std() # Standard deviation
ics_df["Sales"].var() # Variance
ics_df["Sales"].sem() # Standard error
# Negative : Left long tail, Positive : Right long tail
ics_df["Sales"].skew()
# Kurtosis : < 3 less outliers, 3 Normal Distribution,
# > 3 more outliers
ics_df["Sales"].kurt()
ics_df["Sales"].quantile(.5)
ics_df["Sales"].cumsum()
ics_df["Sales"].cumprod()
ics_df["Sales"].cummax()
ics_df["Sales"].cummin()

# Multiple stats at once
ics_df.describe()

ser_dice = pd.Series(data=[2, 3, 3, 4, 4, 4, 5, 5, 5, 5, 6, 6, 
                           6, 6, 6, 7, 7, 7, 7, 7, 7, 8, 8, 8,
                          8, 8, 9, 9, 9, 9, 10, 10, 10, 11, 11, 12])
# Count for each value in series
ser_dice.value_counts()

# You can perform calculations on multiple columns using
# aggregate
print(df_2)
df_2.agg(np.mean)

# You can do this with multiple functions
df_2.agg(['mean', 'std'])

# Iteration

In [201]:
# Iterating over series
ser_7 = pd.Series(range(5), index=['a', 'b', 'c', 'd', 'e'])
ser_7

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [202]:
for col in ser_7:
    print(col)

0
1
2
3
4

In [203]:
# Iterating over DFs
arr_4 = np.random.randint(10, 50, size=(2, 3))
df_8 = pd.DataFrame(arr_4, ['B', 'C'], ['C', 'D', 'E'])
print(df_8)

    C   D   E
B  26  39  33
C  40  18  39

In [204]:
# items allows you to iterate through key value pairs to make
# calculations 1 column at a time
for label, ser in df_8.items():
    print(label)
    print(ser)

C
B    26
C    40
Name: C, dtype: int64
D
B    39
C    18
Name: D, dtype: int64
E
B    33
C    39
Name: E, dtype: int64

In [205]:
# You can also iterate through rows
for index, row in df_8.iterrows():
    print(f"{index}\n{row}")
print()

B
C    26
D    39
E    33
Name: B, dtype: int64
C
C    40
D    18
E    39
Name: C, dtype: int64

In [206]:
# Get a tuple that contains row data
for row in df_8.itertuples():
    print(row)

Pandas(Index='B', C=26, D=39, E=33)
Pandas(Index='C', C=40, D=18, E=39)

# Sorting

In [ ]:
df_8

# Sorting by index will return the same results if indexes
# are in order, to reverse indexes mark ascending as False
df_8.sort_index(ascending=False)

# Sort by value for column D (Use the same function for series)
df_8.sort_values(by='D')

# Pass Data to Function

In [ ]:
import sys

# You can pass DataFrames and Series into functions
def get_profit_total(df):
    prof_ser = df['Profit']
    print(f"Total Profit : {prof_ser.sum()}")

get_profit_total(cs_df)

# Receives a DataFrame, splits the contact into new columns
# being first and last name
def split_name(df):
    def get_names(full_name):
        # Split contact at space
        f_name, l_name = full_name.split()
        # Create a series with first & last names in columns
        # with those labels
        return pd.Series(
        (f_name, l_name),
        index=['First Name', 'Last Name']
        )
    # apply() executes the function on all names in Contact column
    names = df['Contact'].apply(get_names)
    df[names.columns] = names
    return df

# Run function and display top 5 results
split_name(cs_df).head()

# Will assign people to different age groups based on age
def create_age_groups(df):
    # Must have 1 more bins than labels
    bins = [0, 30, 50, sys.maxsize]
    # Group labels
    labels = ['<30', '30-50', '>50']
    
    # cut puts values into certain groups based on intervals
    # The group assigned to <30 has an age between 0 and 30
    # between 30 & 50 is assigned 30-50 and so on
    age_group = pd.cut(df['Age'], bins=bins, labels=labels)
    # Create new column and return new dataframe info
    df['Age Group'] = age_group
    return df

create_age_groups(cs_df)

# You can use a pipe to pass a dataframe to multiple functions
cs_df.pipe(split_name).pipe(create_age_groups).head()

# Aligning, Reindexing and Remaining Labels

In [ ]:
ser_6 = pd.Series(range(5), index=['a', 'b', 'c', 'd', 'e'])
sl_1 = ser_6[:4]
sl_2 = ser_6[1:]
print(sl_1)
print(sl_2)
# Align both series by the union of their indexes
sl_1.align(sl_2)
# Align by calling series
sl_1.align(sl_2, join='left')
# Use passed series indexes
sl_1.align(sl_2, join='right')
# Get where indexes intersect
sl_1.align(sl_2, join='inner')

# You can use align with DFs as well
arr_3 = np.random.randint(10, 50, size=(2, 3))
df_6 = pd.DataFrame(arr_3, ['A', 'B'], ['C', 'D', 'E'])
arr_3 = np.random.randint(10, 50, size=(2, 3))
df_7 = pd.DataFrame(arr_3, ['B', 'C'], ['C', 'D', 'E'])
df_6
df_6.align(df_7)

# reindex allows you to align data by index
ser_6.reindex(['c','b','a'])

# Do the same with DFs
df_6.reindex(['B','A'])

# Drop is very similar to reindex except it receives labels
# you don't want to include
df_6.drop(['A'], axis=0)
df_6.drop(['D'], axis=1)

# You can rename labels
df_6.rename(columns={'C': 'Men', 'D': 'Women', 'E': 'Pets'},
           index={'A': 1, 'B': 2})

# Multiindexing

In [ ]:
# Multi-level indexing allows you to store data on multiple
# dimensions
days = ['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2']
meals = [1,2,3,1,2,3]
# zip pairs the days and meals arrays 
# Then we create a list of those paired tuples
hier_index = list(zip(days, meals))
print(hier_index)
# Converts list of tuples into each row and column
hier_index = pd.MultiIndex.from_tuples(hier_index)
# Generate random array representing calories eaten per meal
arr_5 = np.random.randint(500, 700, size=(6, 2))
df_9 = pd.DataFrame(arr_5, hier_index, ['M', 'F'])
print(df_9)

# Grab the day 1 DF
df_9.loc['Day 1']

# Grab 1st row as a series
df_9.loc['Day 1'].loc[1]

# Grab calories eaten by the female on day 2 for the 2nd meal
df_9.loc['Day 2'].loc[2]['F']

# We can assign names to the Day and Meals Column
df_9.index.names = ['Day', 'Meal']
df_9

# Get a cross section
# This gets me the Day 2 DF
df_9.xs('Day 2')

# Get calories for the 1st meal for both days by saying what
# meal index you want and the Meal column name
df_9.xs(1, level='Meal')

# Create a MultiIndex out of a DF using a pivot table
dict_6 = {'A':['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2'],
         'B': [1,2,3,1,2,3],
         'C': ['M', 'F', 'M', 'F', 'M', 'F'],
         'D': [1,2,3,4,5,6]}
df_14 = pd.DataFrame(dict_6)
# Designate the D column is the data
# Make A & B a multilevel index
# Define column names come from column C
# You will have NaNs where data was missing
df_14.pivot_table(values='D', index=['A','B'], columns=['C'])

# Missing Data

In [ ]:
dict_4 = {'A': [1,2,np.nan], 'B': [4, np.nan, np.nan], 'C': [7.,8.,9.]}
df_10 = pd.DataFrame(dict_4)
print(df_10)

# Drop missing data from DF (Drops any row with missing values)
df_10.dropna()

# Drop all columns with any missing data
df_10.dropna(axis=1)

# Drop row unless it has at least 2 non-NaN values
df_10.dropna(thresh=2)

# Fill NaN values with 0
df_10.fillna(value=0.0)

# Fill A column with the mean of column
df_10['A'].fillna(value=df_10['A'].mean())

# Fill with previous value
df_10.fillna(method='ffill')

# Fill with next value (Only works if there is a next value)
df_10.fillna(method='bfill')

# Experimenting with Data

In [ ]:
cs_df.head() # Get 1st 5
print(cs_df.columns) # Get column names
cs_df['Profit'].mean() # Average profit per item
# Get the product with the highest profit
cs_df[['Product ID', 'Profit']].max(axis=0).head()
# Number of people who purchased from WV
cs_df[cs_df['State']=='WV']['State'].count()
# Number of purchases in 2019
len(cs_df[cs_df['Year']==2019].index)
# Get number of sales for each product type
cs_df['Product ID'].value_counts()
# Get list of customers that bought a specific product
cs_df[cs_df['Product ID']=='M01-F0024']['Contact']
# How many made a website purchase for a profit over $200
cs_df[(cs_df['Lead']=='Website') & (cs_df['Profit']>150)]['Lead'].count()
# Find out how many product profit amounts include .89 in cents
cs_df['Profit'].apply(lambda cents: str(cents).split('.')[1]=='89').value_counts()

# Visulization

In [ ]:
# Library usef to create advanced static, animated and
# interactive visualizations
import matplotlib.pyplot as plt

# Displays matplotlib plots in the Notebook
%matplotlib inline

# Histograms provide an approximation of the distribution of
# results. You create them by dividing the range of values into 
# bins or buckets. Then you count how many of the results fall
# into each bin.
# Rolls 2 dice 5000 times and charts the frequency and 
# a histogram

# Even though the odds increase as you approach 7 and then
# decrease again (1 way to roll a 2 / 6 ways to roll a 7)
# over many rolls they are nearly equal.
df_dice = pd.DataFrame(
    np.random.randint(1,7,5000),
    columns = ['Hist'])
df_dice['Odds'] = df_dice['Hist'] + np.random.randint(1,7,5000)
# Alpha decreases the opacity in the chart
ax = df_dice.plot.hist(bins=12, alpha=0.5)

# Basic plot using 1000 random values that create cumulative sums
# over an increasing date range
ser_5 = pd.Series(np.random.randn(1000),
                 index=pd.date_range('11/15/2017', periods=1000))
ser_5 = ser_5.cumsum()
# ser_5.plot()

# Display 3 random plots
df_15 = pd.DataFrame(np.random.randn(1000, 3),
                    index=pd.date_range('11/15/2017', periods=1000),
                    columns=list('ABC'))
df_15 = df_15.cumsum()
# df_15.plot()

# Make bar chart from 5 random values
# pd.DataFrame(np.random.randn(5)).plot.bar()

# Make MultiBar Charts
vals = ['A', 'B', 'C', 'D']
df_15 = pd.DataFrame(np.random.rand(10,4), columns=vals)
# df_15.plot.bar()

# Area plot 
# Define x range and y values
x_rng = range(1,15)
y_vals = [1,5,4,7,6,9,5,7,10,14,10,12,9,8]
# Change fill color and opacity
# plt.fill_between(x_rng, y_vals, color="skyblue", alpha=0.5)
# plt.show()

# Area plot with multiple areas
# pd.DataFrame(np.random.rand(10,3), columns=['A','B','C']).plot.area()

# Create a scatterplot with 100 random values
# pd.DataFrame(np.random.rand(100,2), 
#              columns=['A','B']).plot.scatter(x='A', y='B')

# Multiple column scatter plots
df_15 = pd.DataFrame(np.random.rand(50,4), columns=['A','B','C','D'])
# ax = df_15.plot.scatter(x='A', y='B', color='DarkBlue', label='Grp 1')
# df_15.plot.scatter(x='C', y='D', color='Orange', label='Grp 2', ax=ax)

# Pie Charts with 4 random values
# pd.Series(np.random.rand(4),
#          index=['a','b','c','d'], 
#           name='Pie').plot.pie(figsize=(6,6))